/***********************************************************************************************************
*执行用时：0 ms, 在所有 Go 提交中击败了100.00%的用户
*内存消耗：2.1 MB, 在所有 Go 提交中击败了57.58%的用户
*1.n为奇数，则只用一个字符填充即可
*2.n为偶数，则使用两个字符填充。
************************************************************************************************************
*/

/***********************************************************************************************************
给你一个整数 n，请你返回一个含 n 个字符的字符串，其中每种字符在该字符串中都恰好出现 奇数次 。
返回的字符串必须只含小写英文字母。如果存在多个满足题目要求的字符串，则返回其中任意一个即可。
************************************************************************************************************
*/
func generateTheString(n int) string {

    buff := make([]byte, n)


    if n % 2 == 1 {
        for i := 0; i < n; i++ {
            buff[i] = 'a'
        }
    } else {
        first := n/2
        if first%2 == 0 {
            first -= 1
        } 
        for i := 0; i < first; i++ {
            buff[i] = 'a'
        }
        
        for i := first; i < n; i++ {
            buff[i] = 'b'
        }

    }
    return string(buff)

}