/**********************************************************************************************************
*1.桶排序
*2.找到缺失的数
*3.题目要求数组长度，数组元素的大小以及k值均不大于1000，所以可以选用此方法
*4.可以考虑二分法查找，就不用局限于输入值了
***********************************************************************************************************
*/

func findKthPositive(arr []int, k int) int {

    buff := make([]int, 2001)    
    len := len(arr)
    var count int
    var i int

    for i := 0; i < len; i++ {
        buff[arr[i]] = 1
    }

    for i = 1; i <= 2001; i++ {
        if buff[i] == 0 {
            count++
            if count == k {
                break
            }
        }
    }    

    return i

}