/***********************************************************************************************************
*执行用时：0 ms, 在所有 Go 提交中击败了 100.00% 的用户
*内存消耗：2.1 MB, 在所有 Go 提交中击败了50.47%的用户
************************************************************************************************************
*/

/***********************************************************************************************************
翻转一棵二叉树。                                            
************************************************************************************************************
*/


/**
 * Definition for a binary tree node.
 * type TreeNode struct {
 *     Val int
 *     Left *TreeNode
 *     Right *TreeNode
 * }
 */

 func invertTree(root *TreeNode) *TreeNode {

    if root == nil { 
        return root
    }

    tmp := root.Left
    root.Left = root.Right
    root.Right = tmp

    invertTree(root.Left)
    invertTree(root.Right)


    return root
}