/***********************************************************************************************************
*执行用时：16 ms, 在所有 Go 提交中击败了88.51%的用户
*内存消耗：7.7 MB, 在所有 Go 提交中击败了11.00%的用户
************************************************************************************************************
*/

/***********************************************************************************************************
给定一个数组 nums，编写一个函数将所有 0 移动到数组的末尾，同时保持非零元素的相对顺序。
************************************************************************************************************
*/

void moveZeroes(int* nums, int numsSize){
    int zeroNum = 0;
    int i;
    int index = 0;
    
    for(i = 0; i < numsSize; i++){
        if(nums[i] == 0){
            zeroNum++;
        }
    }
    
    for(i = 0; i < numsSize; i++){
        if(nums[i] != 0){
            nums[index] = nums[i];
            index++;
        }
    }   
    for(i = numsSize-zeroNum; i < numsSize; i++){
        nums[i] = 0;
    }
    return ;
}