/***********************************************************************************************************
给定一个整型数组，在数组中找出由三个数组成的最大乘积，并输出这个乘积。                                             
************************************************************************************************************
*/

/***********************************************************************************************************
*执行用时：64 ms, 在所有 Go 提交中击败了49.66%的用户
*内存消耗：8.1 MB, 在所有 Go 提交中击败了12.87%的用户
************************************************************************************************************
*/


int comp(const void *a, const void *b)//down sort
{
	return *(int*)a < *(int*)b;
}

int maximumProduct(int* nums, int numsSize){

    int i;
    int product = 1;
    qsort(nums, numsSize, sizeof(int), comp);
    
    for(i = 0; i < 3; i++){
        product *= nums[i];
    }
    
    if(nums[numsSize-1] * nums[numsSize-2] > 0){
        product = product > (nums[0]*nums[numsSize-1] * nums[numsSize-2])?product:\
            (nums[0]*nums[numsSize-1] * nums[numsSize-2]);
    }
    
    
    return product;
}