/***********************************************************************************************************
*执行用时：4 ms, 在所有 Go 提交中击败了98.22%的用户
*内存消耗：5.7 MB, 在所有 Go 提交中击败了30.81%的用户
************************************************************************************************************
*/

/***********************************************************************************************************
数组的每个索引作为一个阶梯，第 i个阶梯对应着一个非负数的体力花费值 cost[i](索引从0开始)。

每当你爬上一个阶梯你都要花费对应的体力花费值，然后你可以选择继续爬一个阶梯或者爬两个阶梯。

您需要找到达到楼层顶部的最低花费。在开始时，你可以选择从索引为 0 或 1 的元素作为初始阶梯。

来源：力扣（LeetCode）
链接：https://leetcode-cn.com/problems/min-cost-climbing-stairs
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
************************************************************************************************************
*/


#define MIN(a, b) ((a)>(b)?(b):(a))

int minCostClimbingStairs(int* cost, int costSize){

    int *buff = NULL;
    int i;
    
    
    buff = (int *)malloc(sizeof(int)*costSize);
    if(buff == NULL){
        printf("malloc error!\n");
        return -1;
    }
    
    memset(buff, 0, sizeof(int)*costSize);
    buff[0] = cost[0];
    //printf("%d ", buff[0]);
    buff[1] = cost[1];
    //printf("%d ", buff[1]);
    for(i = 2; i < costSize; i++){
        buff[i] = MIN(buff[i-1], buff[i-2])+cost[i];
        //printf("%d ", buff[i]);
    }
    
    return MIN(buff[costSize-1], buff[costSize-2]);
}