/***********************************************************************************************************
*执行用时：0 ms, 在所有 Go 提交中击败了100.00%的用户
*内存消耗：2.3 MB, 在所有 Go 提交中击败了26.51%的用户
************************************************************************************************************
*/

/***********************************************************************************************************
给定一组不含重复元素的整数数组 nums，返回该数组所有可能的子集（幂集）。

说明：解集不能包含重复的子集。
************************************************************************************************************
*/



func subsets(nums []int) [][]int {

    var sliceArray []int

    lenNums := len(nums)

    buff := make([][]int, 0, (1 << lenNums)-1)

    for i := 0; i < (1 << lenNums); i++ {

        j := 0
        tmp := i
        sliceArray = make([]int, 0, lenNums)
        for tmp > 0 {
            if tmp & 0x1 == 1 {
                sliceArray = append(sliceArray, nums[j])
            } 

            tmp >>= 1
            j++
        }

        buff = append(buff, sliceArray)

    }


    return buff
}